export const questions = [
  {
    title: 'React - це ... ?',
    variants: ['бібліотека', 'фреймворк', 'додаток'],
    correct: 0,
  },
  {
    title: 'Компонент - це... ',
    variants: [
      'додаток',
      'частина додатка або сторінки',
      'те, що я не знаю, що таке',
    ],
    correct: 1,
  },
  {
    title: 'Що таке JSX?',
    variants: [
      'Це простий HTML',
      'Це функція',
      'Це той же HTML, але з можливістю виконувати JS-код',
    ],
    correct: 2,
  },
  {
    title: 'Що таке useState?',
    variants: [
      'Хук який дозволяє нам відстежувати стан у компоненті функції',
      'Це глобальний стейт',
      'Якщо ви заплутаєтесь, шукайте такий жовтий блок...',
    ],
    correct: 0,
  },
];
